package Step1;

public class Main {
    public static void main(String[] args) {
        // Створюємо нову чергу з максимальною ємністю 3 елементи
        Queue queue = new Queue(3);

        // Додаємо елементи в чергу
        // Додаємо 1.1 в чергу
        queue.enqueue(1.1);
        // Додаємо 2.2 в чергу
        queue.enqueue(2.2);
        // Додаємо 3.3 в чергу
        queue.enqueue(3.3);

        // Виводимо вміст черги
        // Виводимо вміст черги після додавання елементів
        System.out.println("Черга після додавання елементів: " + queue);

        // Видаляємо елементи з черги
        // Видаляємо перший елемент з черги
        queue.dequeue();
        // Видаляємо наступний елемент з черги
        queue.dequeue();

        // Виводимо вміст черги
        // Виводимо вміст черги після видалення елементів
        System.out.println("Черга після видалення елементів: " + queue);
    }
}